asciiary-Sockt-test2.yml
config:
  target: "https://komscoverse.kro.kr"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: Warm up phase
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: Ramp up load
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
  - flow:
    - post:
        url: "/app/auth/usersignin"
        capture:
          - json: "$"
            as: response
    - log: "{{response._sessionToken}}"
    - get:
        url: "/app/main/public-world-join"
        headers:
          sessionToken: "{{response._sessionToken}}"
        capture:
          - json: "$"
            as: responseWorld
    - log: "{{responseWorld}}"
    - log: "https://{{responseWorld._worldData._serverIP}}"

  - engine: "socketio"
    flow:
      - emit:
          target : "https://{{responseWorld._worldData._serverIP}}"
          channel: "connect"
          # headers:
          #   handshake:
          #     auth: 
          #       token: "{{response._sessionToken}}"
          #       joinToken: "{{responseWorld._worldJoinToken}}"